app/controllers/events_controller.rb

	def index
		@event = Event.all.order(id: :asc)
---
SELECT "events".* FROM "events"  ORDER BY "events"."id" ASC

	def reminder
		@user = User.where("last_login < '#{(Time.now) -1.weeks}'")


		@user.each do |userReminder|
		if !userReminder.last_email.blank?
			if Date.parse(userReminder.last_email.to_s) != Date.parse(Time.now.to_s)
				if Date.parse(userReminder.last_email.to_s) < Date.parse(((Time.now) -3.days).to_s)
					Gymail.reminder(userReminder).deliver_now
					userReminder.update_attribute(:last_email, DateTime.now)
---
SELECT "users".* FROM "users" WHERE (last_login < '2016-08-29 12:35:22 -0500')
UPDATE "users" SET "last_email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_email", "2016-09-05 17:41:55.989546"], ["updated_at", "2016-09-05 17:41:55.990432"], ["id", 51]]