app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all.order(start_date: :desc)
---
SELECT "lessons".* FROM "lessons"  ORDER BY "lessons"."start_date" DESC

  def multiply
    @lessons  = Lesson.where(start_date: (Time.zone.now.last_week.beginning_of_week.beginning_of_day)..Time.zone.now.last_week.end_of_week.end_of_day)
    @lessons.each do |newl|
      @new_lesson_date  = (newl.start_date) + 1.weeks
      @check  = Lesson.where(start_date: @new_lesson_date)
      if !@check.present?
        @new_lesson       = Lesson.new(start_date: @new_lesson_date,
                                       users_allowed: newl.users_allowed,
                                       name: newl.name,
                                       description: newl.description,
                                       users_enrolled: 0)
        @new_lesson.save
---
SELECT "lessons".* FROM "lessons" WHERE ("lessons"."start_date" BETWEEN '2016-08-29 00:00:00.000000' AND '2016-09-04 23:59:59.999999')
INSERT INTO "lessons" ("start_date", "users_allowed", "name", "description", "users_enrolled", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)