app/controllers/schedules_controller.rb

  def index
      if params[:search].present?
        fecha           =   params[:search][:start_date]
        fecha_start     =   fecha.to_time.beginning_of_day
        fecha_end       =   fecha.to_time.end_of_day
        @assistance     =   Schedule.where(start_date: (fecha_start)..fecha_end).order(start_date: :asc)
---
SELECT "schedules".* FROM "schedules" WHERE ("schedules"."start_date" BETWEEN '2016-09-05 05:00:00.000000' AND '2016-09-06 04:59:59.999999')  ORDER BY "schedules"."start_date" ASC

  def new
    @user               = User.find(current_user.id)
    @plan               = @user.plan
    @schedules          = @user.schedules.pluck(:lesson_id)
    @arr_lessons_user   = Array(@schedules)

    if Time.now.wday == 0
      if @plan.start_hour == '06:00'
      @lessons_0  = Lesson.where(start_date: (Time.now.beginning_of_week.next_week.beginning_of_day)..Time.now.next_week.beginning_of_week.end_of_day).order(start_date: :asc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 50]]
SELECT "schedules"."lesson_id" FROM "schedules" WHERE "schedules"."user_id" = ?  [["user_id", 50]]
SELECT "lessons".* FROM "lessons" WHERE ("lessons"."start_date" BETWEEN '2016-09-05 05:00:00.000000' AND '2016-09-06 04:59:59.999999')  ORDER BY "lessons"."start_date" ASC

  def appointment

    users_allowed       =   params[:schedule][:users_allowed].to_i
    lesson_id           =   params[:schedule][:lesson_id]
    deleteU             =   params[:schedule][:delete].to_i
    users_enrolled      =   params[:schedule][:users_enrolled].to_i

      if deleteU == 1
          @delete_schedule    =   Schedule.find_by(user_id: current_user.id, lesson_id: lesson_id)
          @user_new           =   User.find(current_user.id)
          @lesson_new         =   Lesson.find(lesson_id)
          @new_user_lessons   =   current_user.lessons + 1
          @users_enrolled     =   users_enrolled - 1

          @lesson_new.update_attribute(:users_enrolled, @users_enrolled)
          @user_new.update_attribute(:lessons, @new_user_lessons)
          @delete_schedule.destroy
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ? AND "schedules"."lesson_id" = ? LIMIT 1  [["user_id", 50], ["lesson_id", 1314]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 50]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 1314]]
UPDATE "lessons" SET "users_enrolled" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["users_enrolled", 1], ["updated_at", "2016-09-06 00:35:20.280753"], ["id", 1314]]
UPDATE "users" SET "lessons" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lessons", 224], ["updated_at", "2016-09-06 00:35:20.276691"], ["id", 50]]
DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 610]]