app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "sandra-munoz2014@hotmail.com"]]
UPDATE "users" SET "last_login" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_login", "2016-09-05 16:04:08.455472"], ["updated_at", "2016-09-05 16:04:08.457386"], ["id", 50]]
---
  def create
  	user = User.find_by(email: params[:session][:email].downcase)
    if user && user.authenticate(params[:session][:password])
      user.update_attribute(:last_login, DateTime.now)