app/controllers/stats_controller.rb

	def admin_index
		@users_active =	User.where(last_login: (Time.now.beginning_of_month)..Time.now.end_of_day)
		@users_new 	  =	User.where(created_at: (Time.now.beginning_of_month)..Time.now.end_of_day)
		@users_total  =	User.all
		@courtesis_month = Courtesie.where(created_at: (Time.now.beginning_of_month)..Time.now.end_of_month)
		@lessons_morning	=	Lesson.where(start_date: (Time.now.beginning_of_month.beginning_of_day)..Time.now.end_of_day, users_enrolled: (1)..10)
---
SELECT "users".* FROM "users" WHERE ("users"."last_login" BETWEEN '2016-09-01 05:00:00.000000' AND '2016-09-05 04:59:59.999999')
SELECT "users".* FROM "users" WHERE ("users"."created_at" BETWEEN '2016-09-01 05:00:00.000000' AND '2016-09-05 04:59:59.999999')
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users" WHERE ("users"."created_at" BETWEEN '2016-09-01 05:00:00.000000' AND '2016-09-05 04:59:59.999999')
SELECT "courtesies".* FROM "courtesies" WHERE ("courtesies"."created_at" BETWEEN '2016-09-01 05:00:00.000000' AND '2016-09-05 04:59:59.999999')
SELECT "lessons".* FROM "lessons" WHERE ("lessons"."start_date" BETWEEN '2016-09-01 05:00:00.000000' AND '2016-09-05 04:59:59.999999') AND ("lessons"."users_enrolled" BETWEEN 1 AND 10)

	def trends
		@users = User.all
		@user_lesson = Schedule.where(user_id: params[:user_id])
---
SELECT "users".* FROM "users"
SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ?  [["user_id", 50]]