app/controllers/users_controller.rb

  def show
  	@user         = User.find(params[:id])
    @schedules    = @user.schedules.where(created_at: (Time.now.beginning_of_month)..Time.now.end_of_month)
    @event        = @user.events.all
    @plan         = @user.plan
    @plans        = Plan.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 50]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ? AND ("schedules"."created_at" BETWEEN '2016-09-01 05:00:00.000000' AND '2016-10-01 04:59:59.999999')  [["user_id", 50]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 50]]
SELECT "plans".* FROM "plans"

  def create
  plan        =   params[:user][:plan_id]
  expiry      =   (Time.now + 1.months)
  @plan_vars   =   Plan.find(plan)

	@user        = User.new(user_params)
  @user.plan_id   = @plan_vars.id
  @user.lessons   = @plan_vars.lessons
  @user.expiry_at = expiry

    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MyString"], ["email", "MyString"], ["created_at", "2016-07-12 21:21:57.286357"], ["updated_at", "2016-07-12 21:21:57.286357"]]

  def update
    # return render json: params[:user][:plan_id]
    @plans  = Plan.all
    posted_expiration  = params[:user][:expiry_at]
    posted_expiration ? (
      expiration    = Date.strptime(posted_expiration,'%m/%d/%Y')
      @user.expiry_at = expiration
      ) : ()
      if @user.update(user_params)
        flash[:success] = "Actualizado correctamente"
        redirect_to request.referer
      else
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 980190962]]